#include "paradef.h"

const QString g_AxiseCarteTypeString[3] = {
    "轴坐标",
    "笛卡尔",
    "XY关联"
};

const QString Beyond_LastDay = {"超过期限,联系厂家解密"};
const QString Beyond_Forever = {"当前期限为永久解密"};
const QString MachineNum_Err[3] = {
    "开发者机器编码输入出错",
    "代理商机器编码输入出错",
    "机器厂家机器编码输入出错"};
const QString Decrypt_ResDis[2] = {"解密成功","解密失败"};
const QString MachineNum_Setted[2] = {"未设", "已设"};
const QString JurisType_Dis[3] = {"开发者", "代理商", "机器厂家"};

const QString Authority_Change[2] = {
    "切换为普通权限",
    "切换为管理员权限"
};

const QString Admin_Authority_Dis[2] = {
    "普通权限",
    "管理员权限"
};

const QString USBH_And_Control[2] = {
    "U盘-->控制器",
    "控制器-->U盘"
};
const QString USBH_CopyStatus_String[21] = {
    "请插入U盘",
    "检测到U盘",
    "程序拷贝中...",
    "拷贝已完成,请拔出U盘",
    "拷贝失败,请检查！",
    "U盘已拔出",
    "U盘错误,请检查！",
    "U盘写保护,请设置！",
    "未找到相关文件！",
    "U盘格式化...",
    "程序下发中...",
    "文件信息读取中... ",
    "主程序拷贝选择错误！",
    "子程序拷贝选择错误！",
    "文件搜索中...",
    "目录打开失败！",
    "文件创建失败！",
    "文件读取失败！",
    "文件打开中...",
    "参数拷贝中...",
    "参数拷贝已完成,请重启"
};
const QString USB_Update_Choice[4] = { //---2018.5.28
    "           ",
    "           ",
    "手持器系统更新",
    "控制器系统更新"
};
const QString USB_UpdateStatus_String[8] = { //---2018.5.28
    "请插入U盘",
    "检测到U盘",
    "U盘已拔出",
    "U盘错误,请检查！",
    "U盘写保护,请设置！",
    "未找到程序文件！",
    "U盘格式化...",
};

const QString SavePoint_Modify_String[5] = {
    "第一组",
    "第二组",
    "第三组",
    "第四组",
    "第五组",
};

const QString Output_Reset_Select_String[6] = {
    "回零前",
    "回零后",
    "普通报警",
    "急停报警",
    "暂停",
    "停止",
};

//密码错误提示
const QString  PasswordError_Tip[3]= {
    "原密码错误，请输入正确原密码!",
    "请输入有效的六位密码!",
    "两次输入密码不一致!",
};

 //蜂鸣器：开关
const QString  Buzzer_Switch[2] = {
    "关",
    "开",
};

const QString  gs_Pass_Word_String= "******";                //显示的隐藏字符
const QString  SoftLimit_On = "开";                           //X轴限位：开
const QString  SoftLimit_Off = "关";                          //X轴限位：关
const QString  X_SafeArea_On = "启用";                        //X轴安全区：启用
const QString  X_SafeArea_Off = "关闭";                       //X轴安全区：关闭
const QString  StartUp_Password_Switch[2] = {"关闭","开启"};
const QString  Edition = "H 3.17.1";                         //版本号

const QString FucSet_Axis[9] = {   //轴选择
    "X",
    "Z",
    "Y",
    "O",
    "X-Y",
    "X-Z",
    "X-O",
    "X-Z-Y",
    "X-Z-Y-O",
};

const QString FucSet_Origin[17] = {   //回原点方式
    "X",
    "Z",
    "Y",
    "O",
    "Y-X",
    "X-Y",
    "Z-X",
    "X-Z",
    "O-X",
    "Z-X-Y",
    "Z-Y-X",
    "Z-Y-X-O",
    "Z-X-Y-O",
    "Y-O-Z-X",
    "Z-O-X-Y",
    "O-Z-X-Y",
    "X-Z-Y-O",
};

const QString FucSet_Acc_Axis[AXIS_NUM] = { //用于加速度时间处的轴选择
    "X",
    "Y",
    "Z",
    "O",
};

const QString Outport_Switch[5] = { //外部端口开关
    "关闭",
    "X13",
    "X14",
    "X15",
    "X16",
};

const QString Origin_Position[2] = { //回原点方向X
    "负端",
    "正端",
};

const QString Origin_Direction[2] = {
    "正向",
    "反向",
};

const QString Alarm_Signal_Dis[2] = {
    "低电平",
    "高电平",
};

const QString Alarm_Switch_Dis[2] = {
    "关闭",
    "打开",
};

const QString InputIO_Detect_IO[INPUT_NUM] = { //输入IO设置IO
    "X0","X1","X2","X3","X4","X5","X6","X7","X9","X9",
    "X10","X11","X12","X13","X14","X15","X16","X17","X18","X19",
    "X20","X21","X22","X23","X24","X25","X26","X27","X28","X29",
};

const QString OutputIO_Detect_IO[OUTPUT_NUM] = { //输出IO设置IO
    "Y0","Y1","Y2","Y3","Y4","Y5","Y6","Y7","Y9","Y9",
    "Y10","Y11","Y12","Y13","Y14","Y15","Y16","Y17","Y18","Y19",
    "Y20","Y21","Y22","Y23","Y24","Y25","Y26","Y27","RY0","RY1",
};

const QString IO_Detect_Switch[2] = { //IO输入常开常闭
    "常开",
    "常闭",
};

const QString LC_Circulation_Mode[3] = { //料仓完成后的循环方式
    "自动",
    "单次",
    "X17",
};

const QString Function_switch[2] = { //绝对值功能开关
    "关闭",
    "开启",
};

const QString Servo_selection[16] = { //伺服选择
    "禾川","汇川","迈信","德宝","星普","禾Y7","红森","英科",
    "   ","   ","   ","   ","   ","   ","   ","   "
};

const QString Encoder_resolution[4] = { //编码器分辨率
    "17位",
    "18位",
    "21位",
    "23位",
};

const QString Move_Direction[2] = { //运动方向
    "正向",
    "反向",
};

const QString JDZ_Axis[AXIS_NUM+1] = { //用于弹窗显示
    " ",
    "X",
    "Y",
    "Z",
    "O",
};

const QString MD_gripSwitch[2] = {  //码垛IO开关
    "关闭",
    "打开",
};

const QString MD_gripNum[MDgrip_Num] = { //码垛IO序号
    "NO1",
    "NO2",
    "NO3",
    "NO4",
    "NO5",
    "NO6",
};

const QString MD_InvalidGrip = "无效";
const QString MD_InvalidGrip2 = "无效";

const QString JDZ_OriginSetting_Dis[3] = { //绝对值位置设置状态
    "未设置",
    "已设置"
};
const QString ELECRESET_Switch[2]= { //开机置0开关
    "关闭",	//0
    "开启"	//1
};
const QString STARTRESET_Switch[2]= { //启动置0开关
    "关闭",	//0
    "开启"	//1
};

const QString ZAxis_Avoidance[2]= { //Z轴防撞
    "关闭",	//0
    "X6"	//1
};
const QString CarCoord_Switch[2]= { //笛卡尔坐标系开关
    "关",   //0
    "开"	    //1
};
const QString AXISType_Switch[2]= { //轴类型
    "直线",  //0
    "旋转"   //1
};
const QString MD_CoordType[4]= { //码垛坐标类型
    "桁架",    //0
    "立柱",	  //1
    "SCARA ", //2
    "抛光"	  //3
};
const QString MD_axisBackMinDir[2]= { //轴回最小坐标的方向
    "顺时针",   //0
    "逆时针"	   //1
};
const QString PF_Switch[2] = { //配方开关
    "关",   //0
    "开"	    //1
};

const QString MD_Methed_String[2] = { //码垛方式
    "连续",    //0
    "分拣",	  //1
};
const QString StackType_String[5] = { //垛型
    "示教",    //0
    "矩阵",    //1
    "双向缩",  //2
    "横向缩",  //3
    "纵向缩"	  //4
};
const QString Property_String[2] = { //属性
    "码垛",    //0
    "拆垛",	  //1
};
const QString RevolveMode_String[2] = { //旋转方式
    "电机",    //0
    "气缸",	  //1
};
const QString MD_goodOffset[2] = { //码垛偏移设置
    "未偏移",  //0
    "已偏移"	  //1
};

//码垛参数拷贝提示
const QString MDPARA_COPY_String[2] = {
    "请选择要拷贝的物品参数",
    "请选择覆盖的物品参数",
};

const QString BlankNon ="无";

const QString  ProgramCode_String[201] = {"    ",
    "1:  ","2:  ","3:  ","4:  ","5:  ","6:  ","7:  ","8:  ","9:  ","10: ",
    "11: ","12: ","13: ","14: ","15: ","16: ","17: ","18: ","19: ","20: ",
    "21: ","22: ","23: ","24: ","25: ","26: ","27: ","28: ","29: ","30: ",
    "31: ","32: ","33: ","34: ","35: ","36: ","37: ","38: ","39: ","40: ",
    "41: ","42: ","43: ","44: ","45: ","46: ","47: ","48: ","49: ","50: ",
    "51: ","52: ","53: ","54: ","55: ","56: ","57: ","58: ","59: ","60: ",
    "61: ","62: ","63: ","64: ","65: ","66: ","67: ","68: ","69: ","70: ",
    "71: ","72: ","73: ","74: ","75: ","76: ","77: ","78: ","79: ","80: ",
    "81: ","82: ","83: ","84: ","85: ","86: ","87: ","88: ","89: ","90: ",
    "91: ","92: ","93: ","94: ","95: ","96: ","97: ","98: ","99: ","100:",
    "101:","102:","103:","104:","105:","106:","107:","108:","109:","110:",
    "111:","112:","113:","114:","115:","116:","117:","118:","119:","120:",
    "121:","122:","123:","124:","125:","126:","127:","128:","129:","130:",
    "131:","132:","133:","134:","135:","136:","137:","138:","139:","140:",
    "141:","142:","143:","144:","145:","146:","147:","148:","149:","150:",
    "151:","152:","153:","154:","155:","156:","157:","158:","159:","160:",
    "161:","162:","163:","164:","165:","166:","167:","168:","169:","170:",
    "171:","172:","173:","174:","175:","176:","177:","178:","179:","180:",
    "181:","182:","183:","184:","185:","186:","187:","188:","189:","190:",
    "191:","192:","193:","194:","195:","196:","197:","198:","199:","200:"
};

const QString Md_DuoPanNum[4] = {"垛盘1","垛盘2","垛盘3","垛盘4"};//垛盘号
const QString Axsis_Choose_String[4] = {"X","Z","Y","O"};

u8  Program_String[116][20]= {
    {"             "},	  //0
    {"主程序开始   "},	  //
    {"主程序结束   "},	  //2
    {"延时         "},
    {"子程序       "},	  //4
    {"跳转指令     "},
    {"循环指令     "},	  //6
    {"循环结束     "},
    {"判断条件     "},
    {"否则         "},
    {"判断结束     "},
    {"特殊指令     "},
    {"输出检测     "},	  //12
    {"正向搜索     "},	  //13
    {"码垛位置     "},     //14
    {"码垛计数     "},	  //15
    {"X轴-移动     "},	  //16
    {"Y轴-移动     "},	  //17
    {"Z轴-移动     "},	  //18
    {"O轴-移动     "},	  //19

    //输出指令
    //20--指令1  ~~~  27--指令8
    {"Y0置位       "},{"Y0复位       "},{"Y1置位       "},{"Y1复位       "},
    {"Y2置位       "},{"Y2复位       "},{"Y3置位       "},{"Y3复位       "},
    //28--指令9  ~~~  35--指令16
    {"Y4置位       "},{"Y4复位       "},{"Y5置位       "},{"Y5复位       "},
    {"Y6置位       "},{"Y6复位       "},{"Y7置位       "},{"Y7复位       "},

    //36--指令17 ~~~  43--指令24
    {"Y8置位       "},{"Y8复位       "},{"Y9置位       "},{"Y9复位       "},
    {"Y10置位      "},{"Y10复位      "},{"Y11置位      "},{"Y11复位      "},

    //44--指令17 ~~~  51--指令24
    {"Y12置位      "},{"Y12复位      "},{"Y13置位      "},{"Y13复位      "},
    {"Y14置位      "},{"Y14复位      "},{"Y15置位      "},{"Y15复位      "},
    //52--指令25 ~~~  59--指令32
    {"Y16置位      "},{"Y16复位      "},{"Y17置位      "},{"Y17复位      "},
    {"Y18置位      "},{"Y18复位      "},{"Y19置位      "},{"Y19复位      "},
    //60--指令33 ~~~  67--指令40
    {"Y20置位      "},{"Y20复位      "},{"Y21置位      "},{"Y21复位      "},
    {"Y22置位      "},{"Y22复位      "},{"Y23置位      "},{"Y23复位      "},
    //68
    {"RY0置位      "},{"RY0复位      "},{"RY1置位      "},{"RY1复位      "},

    //输入指令  72
    {"X0-输入检测 "},
    {"X1-输入检测 "},
    {"X2-输入检测 "},
    {"X3-输入检测 "},
    {"X4-输入检测 "},
    {"X5-输入检测 "},
    {"X6-输入检测 "},
    {"X7-输入检测 "},
    {"X8-输入检测 "},
    {"X9-输入检测 "},
    //输入指令 82
    {"X10-输入检测 "},
    {"X11-输入检测 "},
    {"X12-输入检测 "},
    {"X13-输入检测 "},
    {"X14-输入检测 "},
    {"X15-输入检测 "},
    {"X16-输入检测 "},
    {"X17-输入检测 "},
    {"X18-输入检测 "},
    {"X19-输入检测 "},
    {"X20-输入检测 "},
    {"X21-输入检测 "},
    {"O轴-限位检测 "},
    {"Y轴-限位检测 "},
    {"X轴-限位检测 "},
    {"Z轴-限位检测 "},
    {"O轴-原点检测 "},
    {"Y轴-原点检测 "},
    {"X轴-原点检测 "},
    {"Z轴-原点检测 "},
    {"增量运动     "},  //102
    {"脉宽输出     "},	//103
    {"用户变量     "},  //104
    {"反向搜索     "},	//105
    {"机械回零     "},  //106
    {"坐标复位     "},	//107
    {"减速点       "},	//108
    {"插补开始     "},	//109
    {"插补结束     "},	//110
    {"提前确认     "},	//111
    {"直线插补     "},	//112
    {"三点圆弧     "},	//113
    {"圆心角圆弧   "},	//114
    {"轴移动       "},	//115

};

u8  Parameter_String[120][20]= {
    {"          "}, //0
    {"IO口      "},	//1
    {"IO状态    "},	//2
    {"循环次数  "},	//3
    {"Z轴坐标   "},	//4
    {"延时时间  "},	//5
    {"移动坐标  "},	//6
    {"速度      "},	//7
    {"单次      "},	//8
    {"循环      "},	//9
    {"输出方式  "},	//10
    {"X轴坐标   "},	//11
    {"Y轴坐标   "},	//12
    {"大于等于  "},	//13
    {"小于等于  "},	//14
    {"检测时间  "},	//15
    {"程序开始  "},	//16
    {"程序结束  "},	//17
    {"单次执行  "}, //18
    {"Z轴坐标   "},	//19
    {"只等于    "},	//20
    {"等于倍数  "},	//21
    {"不等于    "},	//22
    {"不等倍数  "},	//23
    {"计数方式  "}, //24
    {"输入方式  "}, //25
    {"IO口      "},	//26
    {"数量      "},	//27
    {"空方式    "}, //28
    {"X轴       "},	//29
    {"Y轴       "},	//30
    {"Z轴       "},	//31
    {"O轴       "},	//32
    {"等待点X   "},	//33
    {"等待点Y   "},	//34
    {"等待点Z   "},	//35
    {"等待点O   "},	//36
    {"子程序号  "}, //37
    {"跳转      "}, //38
    {"高电平    "}, //39
    {"低电平    "}, //40
    {"上升沿    "}, //41
    {"下降沿    "}, //42
    {"X轴       "}, //43
    {"Y轴       "}, //44
    {"Z轴       "}, //45
    {"O轴       "}, //46
    {"暂停      "}, //47
    {"停止      "}, //48
    {"计数器    "}, //49
    {"标签      "}, //50
    {"标签号    "}, //51
    {"位移      "}, //52
    {"有效      "}, //53
    {"无效      "}, //54
    {"输出口    "}, //55
    {"置位      "}, //56
    {"复位      "}, //57
    {"user1     "},	//58
    {"user2     "},	//59
    {"user3     "},	//60
    {"user4     "},	//61
    {"user5     "},	//62
    {"user6     "},	//63
    {"user7     "},	//64
    {"user8     "},	//65
    {" +        "},	//66
    {" -        "},	//67
    {" =        "},	//68
    {" *        "},	//69
    {" /        "},	//70
    {" %        "},	//71
    {"位置      "},	//72
    {"减速点    "},	//73
    {"轴选择1   "},	//74
    {"轴选择2   "},	//75
    {"轴选择3   "},	//76
    {"最大速度  "},	//77
    {"拐点速度  "},	//78
    {"目标点    "},	//79
    {"中间点    "},	//80
    {"终点      "},	//81
    {"圆心      "},	//82
    {"半径      "},	//83
    {"弧长      "},	//84
    {"物品      "},	//85
    {"个数      "},	//86
    {"层数      "},	//87
    {"层满      "},	//88
    {"垛满      "},	//89
    {"大于      "},	//90
    {"小于      "},	//91
    {"自动      "},	//92
    {"位置方式  "}, //93
    {"轴选择    "}, //94
    {"设置坐标值"}, //95
    {"X轴 ≥     "}, //96
    {"Y轴 ≥     "}, //97
    {"Z轴 ≥     "}, //98
    {"O轴 ≥     "}, //99
    {"X轴 =     "}, //100
    {"Y轴 =     "}, //101
    {"Z轴 =     "}, //102
    {"O轴 =     "}, //103
    {"X轴 ≤     "}, //104
    {"Y轴 ≤     "}, //105
    {"Z轴 ≤     "}, //106
    {"O轴 ≤     "}, //107
    {"配方      "},	//108
    {"提前量    "},	//109
};

u8  Alarm_String[80][50] = {
        //Robot_Error_Data[0]
    {"                           "},   //0
    {"无报警                     "},   //1
    //机械手报警
    {"                           "},   //2
    {"                           "},
    {"                           "},   //4
    {"程序打开失败               "},
    {"失能无效,请在首界面操作    "},
    {"机械手通信出错,请检查      "},   //7
    //Robot_Error_Data[1]
    //手持器操作报警
    {"料仓限位报警,请检查        "},   //8
    {"机械手超出安全区           "},
    {"Z轴下降碰撞，请检查        "},   //10   机械手操作报警预留
    {"机械手超出硬限位           "},	 //11   气压报警，请检查
    {"机械手超出软限位           "},   //12
    {"X-O轴间隙小于最小安全距离  "},
    {"伺服器报警,请检查          "},
    {"机械手急停,请回零          "},   //15
    //Robot_Error_Data[2]
    {"当前抽检任务已完成,请处理  "},   //16
    {"码垛位置坐标计算异常,请检查"},
    {"自动运行动作检测超时,请检查"},   //18
    {"处于安全区域边界,请反向操作"},
    {"自动运行程序出错,请处理    "},   //20
    {"当前加工任务已完成,请处理  "},
    {"料仓缺料报警,请处理        "},   //22
    {"料仓满料报警,请处理        "},   //23
    //Robot_Error_Data[3]
    {"X0检测异常                "},   //24
    {"X1检测异常                "},   //25
    {"X2检测异常                "},   //26
    {"X3检测异常                "},   //27
    {"X4检测异常                "},   //28
    {"X5检测异常                "},   //29
    {"X6检测异常                "},   //30
    {"X7检测异常                "},   //31
    //Robot_Error_Data[4]
    {"X8检测异常                "},   //32
    {"X9检测异常                "},   //33
    {"X10检测异常                "},   //34
    {"X11检测异常                "},   //35
    {"X12检测异常                "},   //36
    {"X13检测异常                "},   //37
    {"X14检测异常                "},   //38
    {"X15检测异常                "},   //39
    //Robot_Error_Data[5]
    {"X16检测异常                "},   //40
    {"X17检测异常                "},   //41
    {"X18检测异常                "},   //42
    {"X19检测异常                "},   //43
    {"X20检测异常                "},   //44
    {"X21检测异常                "},   //45
    {"X22检测异常                "},   //46
    {"X23检测异常                "},   //47
    //Robot_Error_Data[6]
    {"X24检测异常                "},   //48
    {"X25检测异常                "},   //49
    {"O轴原点检测异常            "},   //50
    {"Y轴原点检测异常            "},   //51
    {"X轴原点检测异常            "},   //52
    {"Z轴原点检测异常            "},   //53
    {"X30检测异常                "},   //54
    {"输出信号检测异常           "},   //55
    //Robot_Error_Data[7]
    {"X轴驱动器报警              "},   //56
    {"Z轴驱动器报警              "},   //57
    {"Y轴驱动器报警              "},   //58
    {"O/A轴驱动器报警            "},   //59
    {"X轴回原点失败				"},   //60
    {"Z轴回原点失败				"},   //61
    {"Y轴回原点失败				"},   //62
    {"O/A轴回原点失败			"},   //63
        //Robot_Error_Data[8]
    {"当前料仓已满,请更换料仓    "},   //64
    {"获取位置失败，请检查设备   "},   //65
    {"程序间有重复动作，请检查程序"},   //66
    {"                           "},   //67
    {"                           "},   //68
    {"                           "},   //69
    {"                           "},   //70
    {"                           "},   //71
        //Robot_Error_Data[9]
    {"机械手超出X轴最小硬限位     "},   //72
    {"机械手超出Y轴最小硬限位     "},   //73
    {"机械手超出Z轴最小硬限位     "},   //74
    {"机械手超出O轴最小硬限位     "},   //75
    {"机械手超出X轴最大硬限位     "},   //76
    {"机械手超出Y轴最大硬限位     "},   //77
    {"机械手超出Z轴最大硬限位     "},   //78
    {"机械手超出O轴最大硬限位     "},   //79
};


//////////////////////////////ManualOperate//////////////////////////////
const QString SavePoint_Group_Choose_String[5] = {
    "第一组",
    "第二组",
    "第三组",
    "第四组",
    "第五组",
}; //用在40页点保存

const QString FucSet_Point_Axis[AXIS_NUM]= { //用于点输入修改的轴选择
    "X",		//0
    "Y",		//1
    "Z",		//2
    "O",		//3
};

const QString Auto_Status_String[4] = {
    "     ",   	//0
    "待机中",   	//1
    "运行中",   	//2
    "暂停中"   	//3
};
